Revit 2027 API
LayoutRuleMaximumSpacing Constructor
Constructor of LayoutRuleMaximumSpacing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LayoutRuleMaximumSpacing(
	double spacing
)
Public Sub New (
	spacing As Double
)
public:
LayoutRuleMaximumSpacing(
	double spacing
)
new :
        spacing : float -> LayoutRuleMaximumSpacing
Parameters
spacing Double
 The value of spacing must be in (0, 30000).
Remarks
The value of spacing must be in (0, 30000), but in fact the spacing should not be too small or too great.
See Also
Reference
LayoutRuleMaximumSpacing Class
Autodesk.Revit.DB Namespace